backend/app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    render json: Club.all

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
---
  def show
    render json: Club.find(params[:id])