backend/app/controllers/members_controller.rb

  def index
    render json: Member.all
---
SELECT "members".* FROM "members"

  def show
    render json: Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def member_books
    member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE (78aa27fa-026e-41b7-8c2f-433edbb64709) LIMIT ?  [["LIMIT", 1]]