app/controllers/club_controller.rb

  def index
    render json: Club.all
---
SELECT "clubs".* FROM "clubs"

  def show
    render json: Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]